Revit 2026 API

# TemperatureRatingTypeWireSizes Property

---

Get all electrical wire sizes defined in this temperature rating type and its corresponding material type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WireSizeSet WireSizes { get; }
```
```vb
Public ReadOnly Property WireSizes As WireSizeSet
	Get
```
```cpp
public:
property WireSizeSet^ WireSizes {
	WireSizeSet^ get ();
}
```
```fsharp
member WireSizes : WireSizeSet with get
```

#### Property Value

WireSizeSet

#### Reference

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace